Park/src/Documents/ПосещениеАттакциона/ПосещениеАттакциона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеАттакциона</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <attributes>
    <name>Аттакцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </attributes>
</mdclass:Document>

Park/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Park/src/Documents/ПосещениеАттакциона/ObjectModule.bsl
#Область ОбработчикиСобытий

	Procedure Posting(Cancel,Mode)
		//{{__REGISTER_RECORD_WIZARD
		//This fragment was built by the wizard.
		//Warning! All manually made changes will be lost next time you use the wizard.
	
		// register АктивныеПосещения
		RegisterRecords.АктивныеПосещения.Write = True;
		Record = RegisterRecords.АктивныеПосещения.Add();
		Record.Period = Date;
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Основание = Основание;
		Record.Аттракцион = Аттакцион;
		Record.КоличествоПосещений = 1;
		
		RegisterRecords.Write();
			
		//{{QUERY_BUILDER_WITH_RESULT_PROCESSING
		// This fragment was built by the wizard.
		// Warning! All manually made changes will be lost next time you use the wizard.
		
		Query = New Query;
		Query.Text =
			"SELECT
			|	АктивныеПосещенияBalance.Основание
			|FROM
			|	AccumulationRegister.АктивныеПосещения.Balance(, Основание = &Основание) AS АктивныеПосещенияBalance
			|WHERE
			|	АктивныеПосещенияBalance.КоличествоПосещенийBalance < 0";
		
		Query.SetParameter("Основание", Основание);
		
		QueryResult = Query.Execute();
		
		If Not QueryResult.IsEmpty() Then
			Отказ = true;
			Message = New UserMessage();
			Message.Text = "incorrect ticket";
			Message.SetData(ThisObject);
			Message.Field = "Основание";
			Message.Message();
		EndIf;
		
		SelectionDetailRecords = QueryResult.Select();
		
		While SelectionDetailRecords.Next() Do
			// Insert selection processing SelectionDetailRecords
		EndDo;
		
		//}}QUERY_BUILDER_WITH_RESULT_PROCESSING
		
		
	
		//}}__REGISTER_RECORD_WIZARD
	EndProcedure

#КонецОбласти
